---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneState.#ctor
source: html/a0cd9042-b64c-75ff-c45c-d0cb9db80c06.htm
---
# Autodesk.Revit.UI.DockablePaneState.#ctor Method

Creates a new DockablePaneState object.

## Syntax (C#)
```csharp
public DockablePaneState()
```